// pages/news/news.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
    this.setData({
      newsList: [
        {
          title: '十四届五中全会表示，要全面实现现代化主义强国',
          date: '2020-12-07'
        }, {
          title: '世界设计大会于浙江杭州举行，届时会有各方设计人员汇聚',
          date: '2020-12-01'
        }, {
          title: '关于设计的一些小技巧，你知道吗,设计方案的选定，创新力的发掘',
          date: '2020-11-17'
        }, {
          title: '网页设计方案的选定，创新力的发掘',
          date: '2020-11-10'
        }, {
          title: '十四届五中全会表示，要全面实现现代化主义强国',
          date: '2020-12-07'
        }, {
          title: '世界设计大会于浙江杭州举行，届时会有各方设计人员汇聚',
          date: '2020-12-01'
        }, {
          title: '关于设计的一些小技巧，你知道吗,设计方案的选定，创新力的发掘',
          date: '2020-11-17'
        }, {
          title: '网页设计方案的选定，创新力的发掘',
          date: '2020-11-10'
        }, {
          title: '十四届五中全会表示，要全面实现现代化主义强国',
          date: '2020-12-07'
        }, {
          title: '世界设计大会于浙江杭州举行，届时会有各方设计人员汇聚',
          date: '2020-12-01'
        }
      ]
    });
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})
